Autodesk.Revit.DB.IFC.ExporterIFC.GetOrCreateFillPattern(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Color,System.Double)
Get (or create) the IfcFillPatternStyle associated with an ElementId.
fillPatternId:
The fill pattern id.
color:
The pattern color.
planScale:
The view scale.
Returns:
The IfcSurfaceStyle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.SetProject(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the global IfcProject object.
proj:
The IfcProject handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.SetSite(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the global IfcSite object.
site:
The IfcSite handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.GetSite
Gets the global IfcSite object.
Returns:
The handle.
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.GetProject
Gets the global IfcProject object.
Returns:
The handle.
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.RemoveBuildingStorey(Autodesk.Revit.DB.ElementId)
Removes an IFCLevelInfo corresponding to a level from the exporter's internal cache.
id:
The level id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.AddBuildingStorey(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.IFC.IFCLevelInfo)
Adds building storey to the exporter's internal cache.
id:
The level id.
levelInfo:
The IFCLevelInfo object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.SetMaterialIdForCurrentExportState(Autodesk.Revit.DB.ElementId)
This sets the material id that is to be associated with the element in the current export state.
Remarks:
Even though there could be several materials associated with the element (set during PushExportState()),
unless the element has support for IfcMaterialLayerSet, IFC output will include only this one.
elementId:
The material id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.PushExportState(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.GeometryElement)
Sets the internal state of the exporter to process the geometry and properties of the input element.
Remarks:
The element will be assigned until PopExportState() is called.
Elem:
The element.
GRep:
The geometry of the element.  Optional, can be null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.RegisterShapeForPresentationLayer(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets an IfcShapeRepresentation to be used for the IfcPresentationLayerAssignment associated with
the given Revit category and element.
pElement:
The element.
categoryId:
The category id.
newShapeRepresentation:
The IfcShapeRepresentation handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.GetDoorWindowOpeningHandle(Autodesk.Revit.DB.ElementId)
Get the handle to the opening associated with a hosted (door/window) element from the internal cache.
familyInstanceId:
The id of the door or window.
Returns:
The opening handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFC.RegisterDoorWindowForUncreatedOpening(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Registers a door or window in the ExporterIFC's internal cache.  The ids registered correspond to
openings in walls which have not been processed and created yet.
familyInstanceId:
The id of the door or window.
instanceHandle:
The handle to the IfcDoor or IfcWindow created for this instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.Set3DContextHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle,System.String)
Sets the IfcRepresentationContext or IfcRepresentationSubContext handle to be used for 3D entities (Model entities).
contextHandle:
The IfcRepresentationContext for 3D entities.
subContextName:
The name of the IfcRepresentationSubContext, or the IfcRepresentationContext if the string is empty, for 3D entities.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.Get3DContextHandle(System.String)
Obtains the IfcRepresentationContext or IfcRepresentationSubContext handle to be used for 3D entities (Model entities).
Remarks:
The context handle automatically incorporates the angle to true north for the document.
subContextName:
The name of the IfcRepresentationSubContext, or the IfcRepresentationContext if the string is empty, for 3D entities.
Returns:
The IfcRepresentationContext for 3D entities.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.Set2DContextHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the IfcRepresentationContext handle to be used for 2D entities (Annotations).
contextHandle:
The IfcRepresentationContext.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.RegisterFaceWithElementHandle(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Register face with element handle to make sure the openings created are related to the right element.
face:
The face.
elemHandle:
The element handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.IFC.ExporterIFC.GetLevelInfo(Autodesk.Revit.DB.ElementId)
Returns an object representing the information about a level in the document.
Remarks:
Level information is currently automatically collected and cached in the ExporterIFC
object.  This method returns the cached information for a given level,
which is often needed during export of particular building elements which reference levels, as well
as to implement automatic wall and column splitting.
levelId:
The level id.
Returns:
The level information.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.FindSpaceBoundingElementHandle(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Looks up the handle associated to the element and level id from the ExporterIFC's internal cache.
id:
The Revit element id to look for.
levelId:
The element level id.
Returns:
The handle associated to the element and level id.  If the id is not found in the cache, an empty handle
is returned (HasValue == false).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.RegisterSpaceBoundingElementHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Stores a handle representing a space bounding element to the ExporterIFC's internal cache.
Remarks:
The cache of space bounding elements will be used during completion of export to create
relationship objects such as IfcRelSpaceBoundary and IfcRelConnectsPathElements.
The types of Revit elements accepted by this function are:
WallsCurtain wallsRoofsFloorsDoorsWindows
instanceHandle:
The handle to the space bounding element.
id:
The Revit element id associated to this handle.
levelId:
The level id assigned to the space bounding object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.SetOwnerHistoryHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets the handle to the IfcOwnerHistory for the file.
ownerHistory:
The handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.ExporterIFC.GetOwnerHistoryHandle
Gets the handle to the IfcOwnerHistory for the file.
Remarks:
IfcOwnerHistory defines all history and identification related information. In order to provide fast access it is directly attached to all
independent objects, relationships and properties.  IfcOwnerHistory is used to identify the creating and owning application and user for the
associated object, as well as capture the last modifying application and user.  Currently in Revit export to IFC, there is one owner history
for the entire file with some default (for the file) values.
Returns:
The handle to the IfcOwnerHistory for the file.
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.SetFile(Autodesk.Revit.DB.IFC.IFCFile)
Sets the handle to the IFC file being created during this export operation.
file:
The handle to the file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.ExporterIFC.PushTransform(Autodesk.Revit.DB.Transform)
Sets the internal transform of the exporter to process the geometry and properties of the input element.
trf:
The transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014